### Terraform Plan Results 📋

**Environment:** Prod Account (624755517249) ⚠️ PRODUCTION
**Workflow:** `Terraform - Prod Account`
**Run:** [#9](https://github.com/altanova-cloud/altanova-infrastructure/actions/runs/19995026946)

#### Terraform Plan Output

<details>
<summary>View Plan</summary>

```terraform
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.data.aws_caller_identity.current[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e0b1c220a28d4a87]
module.vpc.data.aws_region.current[0]: Reading...
module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.deployment_role.aws_iam_role.deployment: Refreshing state... [id=ProdDeployRole]
module.vpc.data.aws_region.current[0]: Read complete after 0s [id=eu-west-1]
module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=624755517249]
module.deployment_role.aws_iam_role_policy.deployment: Refreshing state... [id=ProdDeployRole:ProdDeploymentPolicy]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-069e420ad6e0f43eb]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06aad310786bdb3b2]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0bfe2f8c72f912c54]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e02de1f01b0ae026]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0429ee9e2b056daca]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-051e758e39d8016f3]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-042f41c163ed213cb]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c5ca700b86e11d0d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-001637b7128acd6b0]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-069fbc2e5c3fb17df]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09a11fe4d3d9461d1]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-088af1a77cfc1149c]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0bd1036d83af61eb3]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0e0b1c220a28d4a87]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-01a165a9d811cd5d2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f78a9abae6473ccb]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0bd8b138f8d38d5e0]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=altanova-prod-euw1-vpc]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-040db6f906e0dbb8b]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-071f610f980d00759]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0422d0942279e20e4]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-00669d0f09fa57ff6]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-06b7a6f02e215d526]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0773d31a0af81fcd3]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-04efe156e003b96cc]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0bd8b138f8d38d5e01080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-02bc3a41d4e2e4acd]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0086c73c601a0bb4c]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0a9bea5faa9356be1]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=4261584361]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-01a165a9d811cd5d21080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.deployment_role.aws_iam_role.deployment will be updated in-place
  ~ resource "aws_iam_role" "deployment" {
        id                    = "ProdDeployRole"
        name                  = "ProdDeployRole"
        tags                  = {
            "Environment" = "prod"
            "ManagedBy"   = "Terraform"
            "Name"        = "ProdDeployRole"
            "Purpose"     = "GitHub Actions deployment role"
        }
      ~ tags_all              = {
          + "Project"     = "AltaNova"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-069e420ad6e0f43eb"
        name                   = "default"
      ~ tags                   = {
            "Environment" = "prod"
            "ManagedBy"   = "Terraform"
          ~ "Name"        = "altanova-prod-euw1-vpc-default" -> "altanova-prod-euw1-default-sg"
            "Project"     = "AltaNova"
        }
      ~ tags_all               = {
          ~ "Name"        = "altanova-prod-euw1-vpc-default" -> "altanova-prod-euw1-default-sg"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = "arn:aws:logs:eu-west-1:624755517249:log-group:/aws/vpc-flow-log/vpc-0e0b1c220a28d4a87"
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
      + tags_all                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-0e0b1c220a28d4a87"
    }

  # module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "vpc-flow-log-to-cloudwatch-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:eu-west-1:624755517249:log-group:/aws/vpc-flow-log/vpc-0e0b1c220a28d4a87:*"
                      + Sid      = "AWSVPCFlowLogsPushToCloudWatch"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
    }

  # module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = "AWSVPCFlowLogsAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "vpc-flow-log-role-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "AltaNova"
        }
      + unique_id             = (known after apply)
    }

  # module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + default_security_group_id  = "sg-069e420ad6e0f43eb"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Next Steps:**
- Review the plan carefully - this is PRODUCTION
- If approved, merge this PR to trigger apply
- **Manual approval will be required** before apply executes
